{"pages":[{"title":"关于","text":"做一点点记录","link":"/about/index.html"}],"posts":[{"title":"《精进：如何成为一个很厉害的人》读书笔记","text":"&ensp;&ensp;&ensp;&ensp;上周读完了《精进：如何成为一个很厉害的人》，是斐哥和小不点推荐的。主要感受有两个，一个是，这本书的确很好，很多问题分析得相当到位，另一个是，一周一本书的目标其实不难，只要把这个目标分解成每天的简单任务就可以，其他要解决的事情也是同理。下面是这本书给我启示的一些句子： 在个人资源有限的情况下，我们首先应该几种资源，投入发展自己的一项优势才能。 意志力是非常不可靠的，你越强调它，越依赖它，你中途放弃的可能性就越大。因为意志力总有可以承受的极限，就像一根已经绷得很紧得绳子，若是再用力的话，随时都会绷断。 也许人与人之间，在先天禀赋上确实有多多少少的差异，但这些差异在可习得和可演练得思维方法面前，都显得不是太重要。一个具有高度可塑性得大脑在良好思维工具得辅佐下，在持续不断得行动的打磨中，会强大得超出你的想象。 但是归根结底，这些问题还得由我们自己来解答，别人的帮助只是一种推动，但知识构建的过程是他人无法替代的。提问是将我们引向深度学习的起点。一位优秀的学习者，必定是一个优秀的提问者，他从阅读、观察和思考的过程中产生问题，先解答表层的、容易的部分，留下深度的、探索式的问题给自己，并在由此问题招致的持续困扰和折磨中开启卓越的心智旅程。 牛人总是在前瞻性思维和总结性思维上都非常出色。 写论文也是。一篇论文的图层可能包括：核心论点以及逻辑架构、用于解释说明的案例和故事、必要的模型图和概念图等。那么在写作时，就剋按照不同的图层，依次进行构建。假如一篇文章按阅读次序有A、B、C三个部分，那么我可能不是把A写好，再写B，再写C，而更可能把A、B、C的核心论点以及逻辑架构都先写好，然后再集中寻找案例素材，并分别填入A、B、C，再用同样的方法插入图示等。 这就是多线程工作的秘诀。很多时候，你只是需要一个专注不受干扰的、能纯粹跳脱出来思考的、能达至“心流”状态的、能把最关键的“硬核”搞定的半小时。 如果总能想到一件事就完成一件，那么我们同时应对的事情就少了，也就不用多花心思去“管理”这些事情。而待完成的事情一朵，管理的复杂度就直线上升，相应地，记忆负担、情绪负担和人际负担也会显著加重。这些心理成本虽然时隐性的，却影响着我们的生活质量。随着事情越积越多，我们慢慢会觉得无法承受，情绪上的各种问题首先会爆发，然后与周围人的关系也会变差，于是生活开始失控。 “去发现和追求自己所热爱的东西”，而不是追寻“某种预设期待的轨迹”。 一个选择当然可能改变一个人的一生，但多年以后，一个新的选择也可能颠覆原先那个关键的选择，使人生走向一个新的放下给或者重新驶回曾经的轨道。如果这样看的话，选择时可以被修正、被重塑的，单次选择的重要性也许被我们高估了。 在“你的方法”和“我的方法”之外，应该努力寻找一个“我们的方法”，通过这个“第3选择”，参与的双方可以实现协同和双赢。 与之相对的时“成长型心智”（growth mindset），拥有这种心智的人认为智力和才能是可以通过努力不断增长的，因而并不惧怕短期的失效，反而会愈挫愈勇，这样的人往往能获得更高的成就。 当我们在人生中遇到某个无法摆脱的僵局时，先不妨试试这三步：1.找出潜意识中的隐含假设；2.识别隐含假设中的不合理性，进行校正；3.形成新的更灵活的思维框架，在此基础上思考出“可能选项”并进行尝试。 人生那么短，路又那么长，你好好走就是了。 执行无能：就是指我明知道这个事情很重要，但就是不去做。对广大“拖延症患者”来说，往往一个事情看上去越重要，内心的恐惧感就越大，就越容易拖，最后一事无成。 “五年”意味着你可以去精熟一门可以傍身的技能，或者在一个学术领域完成系统性的知识储备……它意味着你可以去思考有没有可能坚持做好一件有价值的事情，甚至把它做到极致。 未来并非遥不可及，它就出现在即将到来的每一分每一秒。 成功是一个爱恨交织的字眼，无数人为了所谓的成功变成了他们原本讨厌的人，而我更相信，只有坚持做一个你所喜欢的自己，你才可能实现真正意义上的成功。 &ensp;&ensp;&ensp;&ensp;本周目标：《人类群星闪耀时》","link":"/2018/07/01/《如何成为一个很厉害的人》读书笔记/"},{"title":"何为张量","text":"&ensp;&ensp;&ensp;&ensp;在机器学习中一直看到张量这个术语，但又一直似懂非懂，终于在汤晓鸥教授主编的《人工智能基础（高中版）》中看到了最形象的解释： 张量是数学、物理及工程学科中的一个重要概念，我们之前遇到的许多概念都是张量的特殊形式，例如标量（scalar）属于零阶张量，向量是一阶张量，而矩阵则是二阶张量。","link":"/2018/06/25/何为张量/"},{"title":"快速开始","text":"&ensp;&ensp;&ensp;&ensp;面对比较棘手的问题，我们通常比较畏惧，这是导致一直拖延的最大原因。而应对这种状况的方法只有一种，那就是快速开始，即使是个特别差的开始，也比无穷无尽的所谓准备要好的多。在开始后，我们才能真正知道我们需要怎么做，哪里是难点，哪里是容易的地方。当面对难题的时候，硬着头皮去试试，多少做一些事情，快速进入到实践中去。而且，我们的思路是慢慢展开的，一直在脑海中演练，其实没有任何帮助，必须外化成实际的东西，才更有条理。","link":"/2018/06/26/快速开始/"},{"title":"音乐首页","text":"前期准备中…","link":"/2018/06/25/音乐首页/"},{"title":"坚持改变第一天","text":"&ensp;&ensp;&ensp;&ensp;最大的原因，就是对自己不满意，现状与曾经的期望严重不符。日复一日，都是对过去无尽的遗憾，还有现在的裹足不前，然后就会越来越差。好在，我有一群上进又挺我的朋友，将我从这个恶性循环中拉出来。但往往，我们在做改变的开始，都是信心满满，豪情壮志，当短期回报不太明显时，又容易回到原来的状态。所以，写下从今开始的心路历程，为自己的改变做一个记录，每天自我反思，自我激励，从而让这种向上的改变持续下去。&ensp;&ensp;&ensp;&ensp;回忆自己没有做好的事情，究其原因，多半是没有专注去做。其实应该认识到，这个想做，另一个也想做，但是人的精力有限，无法全都兼顾，到最后这些事情都没做好。所以倒不如这样，要是做一个事情，就要专心、认真、持续地去做它。比如说，我今天开始读《精进：如何成为一个很厉害的人》，不要求一周一定要读多少书，不给自己太大的压力，也不浪费时光、虚度光阴，而是定下一个切实可行的目标，让自己能优质地完成这件事。这本书总共400多页，因此我打算每天在地铁或者公交上读不少于80页，只要这周完成就好，最重要的是认真读，不敷衍，去感受书中作者想表达的东西。另外，看电影或者电视，不要快进，要看就认真看，入戏体验，而不是为了消磨无聊的时光。&ensp;&ensp;&ensp;&ensp;对当前的事情，尽量要选择所谓半衰期长的事情，也就是可以给自己留下记忆的，有意义的事情。就像《精进》书中所说，玩游戏这种事情，半衰期很短，只是消磨时光，并不会产生什么延续比较长的感受。而当我们选择一些有意义的事，比如练习书法，比如好好读一本书的时候，即使这个事情结束，我们仍然可以从回忆中汲取到一些营养，在一定程度上，这也算延长了我们的人生长度。另外，我们更需要培养一个持续的爱好，打球、写文章等等，都行，反正需要有一个一直为之努力的爱好，一方面技多不压身，更重要的是，一个自己擅长的、一直维持的爱好，会给自己带来天然的自信和享受爱好的愉悦。&ensp;&ensp;&ensp;&ensp;且行且看吧，坚持下去才是最重要的。","link":"/2018/06/25/坚持改变第一天/"}],"tags":[],"categories":[{"name":"生活","slug":"生活","link":"/categories/生活/"},{"name":"技术","slug":"技术","link":"/categories/技术/"},{"name":"音乐","slug":"音乐","link":"/categories/音乐/"}]}